---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemShortenAngley
source: html/8daed0f7-4f24-cefd-64dd-eeed5ee2de67.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemShortenAngley Property

"Angle along height"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemShortenAngley { get; }
```